# YOLO11-PAS-seg - https://github.com/Anawaert/YOLO11-PAS-seg

# Parameters - 参数
nc: 3  # number of classes - 类别数
scales:
  # [depth, width, max_channels] - 【深度, 宽度, 最大通道数】
  m: [0.50, 1.00, 512]

# YOLO11-PAS-seg backbone - 主干网络
backbone:
  # [from, repeats, module, args] - [链路上级, 重复次数, 模块名, 构造函数参数]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2Ghost, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2Ghost, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2Ghost, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2Ghost, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11-PAS-seg head - 头部
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, BiFPNCat2, [1]] # cat backbone P4
  - [-1, 2, C3k2Ghost, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, BiFPNCat2, [1]] # cat backbone P3
  - [-1, 2, C3k2Ghost, [256, False]] # 16 (P3/8-small)
  - [-1, 3, CCAM, [256]] # 17

  - [-1, 1, Conv, [256, 3, 2]] # 18
  - [[-1, 6, 13], 1, BiFPNCat3, [1]] # cat head P4
  - [-1, 2, C3k2Ghost, [512, False]] # 20 (P4/16-medium)
  - [-1, 3, CCAM, [512]] # 21

  - [-1, 1, Conv, [512, 3, 2]] # 22
  - [[-1, 10], 1, BiFPNCat2, [1]] # cat head P5
  - [-1, 2, C3k2Ghost, [1024, True]] # 24 (P5/32-large)
  - [-1, 3, CCAM, [1024]] # 25

  - [[17, 21, 25], 1, Segment, [nc, 32, 256]] # Segment(P3, P4, P5)
